tap "charmbracelet/tap"
tap "cockroachdb/tap"
tap "jaxxstorm/tap"
tap "minio/stable"
tap "oven-sh/bun"
tap "peak/tap"
tap "pulumi/tap"
tap "redpanda-data/tap"
tap "restatedev/tap"
tap "sass/sass"
tap "sst/tap"
tap "twitchdev/twitch"
tap "wader/tap"
# Generic-purpose lossless compression algorithm by Google
brew "brotli"
# Code searching, linting, rewriting
brew "ast-grep"
# Improved shell history for zsh, bash, fish and nushell
brew "atuin"
# Automatic configure script builder
brew "autoconf"
# Terminal bandwidth utilization tool
brew "bandwhich"
# GNU internationalization (i18n) and localization (l10n) library
brew "gettext"
# Clone of cat(1) with syntax highlighting and Git integration
brew "bat"
# Toolchain of the web
brew "biome"
# Yet another cross-platform graphical process/system monitor
brew "bottom"
# Resource monitor. C++ version and continuation of bashtop and bpytop
brew "btop"
# New way of working with Protocol Buffers
brew "buf"
# Powerful, enterprise-ready, open source web server with automatic HTTPS
brew "caddy"
# Multi-platform, multi-architecture disassembly framework
brew "capstone"
# Object-file caching compiler wrapper
brew "ccache"
# Command-line interface for SQLite
brew "sqlite"
# Interpreted, interactive, object-oriented programming language
brew "python@3.13"
# Make choices on the command-line
brew "choose"
# CLI tool for Cloudflare Workers
brew "cloudflare-wrangler"
# Cloudflare Tunnel client (formerly Argo Tunnel)
brew "cloudflared"
# Cross-platform make
brew "cmake"
# GNU File, Shell, and Text utilities
brew "coreutils"
# Load/unload environment variables based on $PWD
brew "direnv"
# Tool for exploring each layer in a docker image
brew "dive"
# Embeddable SQL OLAP Database Management System
brew "duckdb"
# Disk Usage/Free Utility - a better 'df' alternative
brew "duf"
# More intuitive version of du in rust
brew "dust"
# Modern, maintained replacement for ls
brew "eza"
# Like neofetch, but much faster because written mostly in C
brew "fastfetch"
# Simple, fast and user-friendly alternative to find
brew "fd"
# Play, record, convert, and stream audio and video
brew "ffmpeg"
# User-friendly command-line shell for UNIX-like operating systems
brew "fish"
# Command-line fuzzy finder written in Go
brew "fzf"
# GitHub command-line tool
brew "gh"
# Distributed revision control system
brew "git"
# Syntax-highlighting pager for git and diff output
brew "git-delta"
# Blazing fast terminal-ui for git written in rust
brew "gitui"
# Open source programming language to build simple/reliable/efficient software
brew "go"
# Ping, but with a graph
brew "gping"
# Command-line tool for generating regular expressions
brew "grex"
# Kubernetes package manager
brew "helm"
# Configurable static site generator
brew "hugo"
# Command-line benchmarking tool
brew "hyperfine"
# Tools and libraries to manipulate images in many formats
brew "imagemagick"
# Update of iperf: measures TCP, UDP, and SCTP bandwidth
brew "iperf3"
# Lightweight and flexible command-line JSON processor
brew "jq"
# Handy way to save and run project-specific commands
brew "just"
# Little helper to run CNCF's k3s in Docker
brew "k3d"
# Kubernetes command-line interface
brew "kubernetes-cli"
# Tool that can switch between kubectl contexts easily and create aliases
brew "kubectx"
# Simple terminal UI for git commands
brew "lazygit"
# Linux virtual machines
brew "lima"
# Just-In-Time Compiler (JIT) for the Lua programming language
brew "luajit"
# Utility for directing compilation
brew "make"
# Simple tool to make locally trusted development certificates
brew "mkcert"
# Ambitious Vim-fork focused on extensibility and agility
brew "neovim"
# Swiss-army knife of markup format conversion
brew "pandoc"
# Fast, disk space efficient package manager
brew "pnpm"
# Object-relational database system
brew "postgresql@17", restart_service: :changed, link: true
# Protocol buffers (Google's data interchange format)
brew "protobuf"
# Go support for Google's protocol buffers
brew "protoc-gen-go"
# Protoc plugin that generates code for gRPC-Go clients
brew "protoc-gen-go-grpc"
# Generic machine emulator and virtualizer
brew "qemu"
# Rsync for cloud storage
brew "rclone"
# Persistent key-value database, with built-in net interface
brew "redis", restart_service: :changed
# Search tool like grep and The Silver Searcher
brew "ripgrep"
# Extremely fast Python linter, written in Rust
brew "ruff"
# Modern Day Portscanner
brew "rustscan"
# Rust toolchain installer
brew "rustup"
# Fast and accurate code counter with complexity and COCOMO estimates
brew "scc"
# Intuitive find & replace CLI
brew "sd"
# Crypto and x509 Swiss-Army-Knife
brew "step"
# Temporal CLI (tctl)
brew "tctl"
# Very fast implementation of tldr in Rust
brew "tealdeer"
# Command-line interface for running and interacting with Temporal Server and UI
brew "temporal"
# Tool to build, change, and version infrastructure
brew "terraform"
# Thin wrapper for Terraform e.g. for locking state
brew "terragrunt"
# Terminal multiplexer
brew "tmux"
# Program that allows you to count code, quickly
brew "tokei"
# Modern reverse proxy
brew "traefik"
# Extraction utility for .zip compressed archives
brew "unzip"
# Extremely fast Python package installer and resolver, written in Rust
brew "uv"
# Secures, stores, and tightly controls access to secrets
brew "vault"
# Internet file retriever
brew "wget"
# Network analyzer and capture tool - without graphical user interface
brew "wireshark"
# Friendly and fast tool for sending HTTP requests
brew "xh"
# Process YAML, JSON, XML, CSV and properties documents from the CLI
brew "yq"
# Shell extension to navigate your filesystem faster
brew "zoxide"
# A powerful terminal-based AI assistant for developers, providing intelligent coding assistance directly in your terminal.
brew "charmbracelet/tap/crush"
# Distributed SQL database
brew "cockroachdb/tap/cockroach"
# MinIO Client for object storage and filesystems
brew "minio/stable/mc"
# Incredibly fast JavaScript runtime, bundler, transpiler and package manager - all in one.
brew "oven-sh/bun/bun"
# Parallel S3 and local filesystem execution tool
brew "peak/tap/s5cmd"
# Pulumi ESC - Manage Environments, Secrets, and Configuration
brew "pulumi/tap/esc"
# Pulumi - Modern Infrastructure as Code. Any cloud, any language 
brew "pulumi/tap/pulumi"
# Redpanda CLI & toolbox
brew "redpanda-data/tap/redpanda"
# Restate CLI
brew "restatedev/tap/restate"
# Restate Server
brew "restatedev/tap/restate-server"
# CLI for Twitch's developer offerings
brew "twitchdev/twitch/twitch-cli"
# Command-line interface for 1Password
cask "1password-cli"
# Column-oriented database management system
cask "clickhouse"
cask "font-meslo-lg-nerd-font"
cask "font-noto-nerd-font"
cask "font-sauce-code-pro-nerd-font"
# Terminal emulator that uses platform-native UI and GPU acceleration
cask "ghostty"
# Full TeX Live distribution with GUI applications
cask "mactex"
# Replacement for Docker Desktop
cask "orbstack"
# SQL powered operating system instrumentation and analytics
cask "osquery"
vscode "biomejs.biome"
vscode "bradlc.vscode-tailwindcss"
vscode "charliermarsh.ruff"
vscode "esbenp.prettier-vscode"
vscode "golang.go"
vscode "james-yu.latex-workshop"
vscode "k--kato.intellij-idea-keybindings"
vscode "ms-python.debugpy"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-toolsai.jupyter"
vscode "ms-toolsai.jupyter-keymap"
vscode "ms-toolsai.jupyter-renderers"
vscode "ms-toolsai.vscode-jupyter-cell-tags"
vscode "ms-toolsai.vscode-jupyter-slideshow"
vscode "ms-vscode-remote.remote-ssh"
vscode "ms-vscode-remote.remote-ssh-edit"
vscode "ms-vscode.cpptools"
vscode "ms-vscode.remote-explorer"
vscode "ms-vscode.remote-server"
vscode "ms-vscode.vscode-typescript-next"
vscode "mvllow.rose-pine"
vscode "openai.chatgpt"
vscode "pulumi.pulumi-lsp-client"
vscode "pulumi.pulumi-vscode-tools"
vscode "rust-lang.rust-analyzer"
# removed vscode "sourcegraph.cody-ai"
vscode "svelte.svelte-vscode"
