# Brewfile for dotfiles dependencies
# Run: brew bundle install

# Taps
tap "homebrew/cask-fonts"

# Essential development tools
brew "git"
brew "gh"
brew "neovim"
brew "tmux"
brew "fzf"
brew "ripgrep"
brew "fd"
brew "bat"
brew "eza"
brew "zoxide"
brew "atuin"
brew "direnv"

# Shell enhancements
brew "fish"
brew "jq"
brew "yq"
brew "tree"
brew "tldr"
brew "htop"
brew "btop"
brew "procs"
brew "dust"
brew "duf"
brew "ncdu"
brew "gping"
brew "hyperfine"
brew "tokei"
brew "just"
brew "httpie"
brew "gitui"
brew "lazygit"
brew "bottom"
brew "bandwhich"
brew "choose"
brew "xh"
brew "grex"
brew "tealdeer"

# Development languages & tools
brew "go"
brew "rustup"
brew "node"
brew "python@3.13"
brew "bun"
brew "pnpm"
brew "uv"
brew "ruff"

# Database & storage
brew "postgresql@17"
brew "redis"
brew "cockroach"
brew "duckdb"
brew "sqlite"

# Cloud & infrastructure
brew "pulumi"
brew "helm"
brew "kubernetes-cli"
brew "kubectx"
brew "k3d"
brew "vault"
brew "step"
brew "terraform"
brew "terragrunt"
brew "cloudflared"
brew "cloudflare-wrangler"

# Docker & containers
brew "dive"
brew "lima"
brew "qemu"

# Network & security
brew "nmap"
brew "mkcert"
brew "rustscan"
brew "wireshark"

# Media & documentation
brew "pandoc"
brew "hugo"
brew "ffmpeg"
brew "imagemagick"

# System utilities
brew "coreutils"
brew "wget"
brew "unzip"
brew "make"
brew "cmake"
brew "autoconf"
brew "ccache"
brew "xz"
brew "zstd"

# Code quality & analysis
brew "ast-grep"
brew "biome"
brew "cloc"
brew "scc"
brew "buf"
brew "protobuf"
brew "protoc-gen-go"
brew "protoc-gen-go-grpc"

# Monitoring & observability
brew "caddy"
brew "traefik"
brew "iperf3"
brew "fastfetch"
brew "neofetch"

# Specialized tools
brew "temporal"
brew "tctl"
brew "restate"
brew "restate-server"
brew "redpanda"
cask "clickhouse"
brew "rclone"
brew "s5cmd"
brew "mc"
brew "tig"
brew "delta"
brew "sd"

# Fonts
cask "font-meslo-lg-nerd-font"
cask "font-noto-nerd-font"
cask "font-sauce-code-pro-nerd-font"

# Applications
cask "ghostty"
cask "orbstack"
cask "1password-cli"
cask "mactex"
cask "osquery"